In [2]:
import pandas as pd
from sqlalchemy import create_engine 
# CSV 파일을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_csv("../dataset/customerData.csv")

# 타겟 컬럼 정의 및 조회
targetColumns = ["CUSTID","AVGPRICE"]
customerDataC = customerData.loc[ : ,targetColumns ]
# [행,열] :의 뜻은 전체 행이라는 뜻!

# 데이터 VIEW
customerDataC.head(2)

   CUSTID    AVGPRICE
0  A13566  4273.90000
1  A14219  3642.44195

In [3]:
targetColumns = ["CUSTID", "END"]

In [4]:
customerDataC3 = customerDataC

In [5]:
customerDataC3.CUSTID = 1

In [6]:
customerDataC.head() # 얘도 바뀜. '링크가 걸렸다' 라고 표현

   CUSTID     AVGPRICE
0       1  4273.900000
1       1  3642.441950
2       1  3653.884565
3       1  3713.211107
4       1  3391.074215

In [7]:
customerDataC3.head()

   CUSTID     AVGPRICE
0       1  4273.900000
1       1  3642.441950
2       1  3653.884565
3       1  3713.211107
4       1  3391.074215

In [8]:
customerDataC4 = customerDataC.copy() # copy()로 하니 C4만 바뀜

In [9]:
customerDataC4.CUSTID = 999

In [10]:
customerDataC.head()

   CUSTID     AVGPRICE
0       1  4273.900000
1       1  3642.441950
2       1  3653.884565
3       1  3713.211107
4       1  3391.074215

In [11]:
customerDataC4.head()

   CUSTID     AVGPRICE
0     999  4273.900000
1     999  3642.441950
2     999  3653.884565
3     999  3713.211107
4     999  3391.074215

In [12]:
import numpy as np

### 데이터 조작방법
1. np.where 조작한다. (제일 빠름, 복잡한 로직에는 힘듬)
2. 함수를 활용하여 조작한다. (복잡한 로직에도 강하다!)
3. loc 함수를 활용하여 조작한다. (가독성이 뛰어나나 속도가 떨어진다)
4. map 함수를 사용할수도 있다. (머신 / 딥러닝에서 많이 사용된다!)

In [13]:
# 함수활용

In [14]:
# 함수정의
# inputValue < 1 : 1
# 1 <= inputValue < 2 : 2
# inputValue >= 2 : 3

In [15]:
def valueCluestering(inValue):

    #inValue = 2
    outValue = inValue

    if inValue < 1:
        outValue = 1
    elif inValue < 2:
        outValue = 2
    else:
        outValue = 3
    return outValue

In [16]:
customerData["PRODUCTAGE_NEW"] = customerData.PRODUCTAGE.apply(valueCluestering)

In [17]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5,3.208202,Sleeping-dog,3
3,A16605,3713.211107,2,6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4,2.453656,Sleeping-dog,3

In [18]:
# np.where 방식

In [19]:
customerData["PRODUCTAGE_NEW"] = \
    np.where ( customerData.PRODUCTAGE < 1, 1, 0)

In [20]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6,1.679181,Big-Screen-lover,0
1,A14219,3642.441950,2,4,2.682023,Sleeping-dog,0
2,A15312,3653.884565,2,5,3.208202,Sleeping-dog,0
3,A16605,3713.211107,2,6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4,2.453656,Sleeping-dog,0

In [21]:
customerData.loc [ (customerData.PRODUCTAGE < 1) &
                   (customerData.PRODUCTAGE_NEW !=1)]

Empty DataFrame
Columns: [CUSTID, AVGPRICE, EMI, DEVICECOUNT, PRODUCTAGE, CUSTTYPE, PRODUCTAGE_NEW]
Index: []

In [22]:
#np.where 방식

In [23]:
customerData["PRODUCTAGE_NEW"] = \
    np.where ( customerData.PRODUCTAGE < 1, 1, customerData.PRODUCTAGE)

In [24]:
customerData.loc [ (customerData.PRODUCTAGE >= 1) &
                   (customerData.PRODUCTAGE_NEW != customerData.PRODUCTAGE)]

Empty DataFrame
Columns: [CUSTID, AVGPRICE, EMI, DEVICECOUNT, PRODUCTAGE, CUSTTYPE, PRODUCTAGE_NEW]
Index: []

In [25]:
customerData["PRODUCTAGE_NEW"] = \
    np.where( customerData.PRODUCTAGE < 1, 1,\
            np.where (customerData.PRODUCTAGE <= 2, 2, 3))

In [26]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5,3.208202,Sleeping-dog,3
3,A16605,3713.211107,2,6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4,2.453656,Sleeping-dog,3

In [27]:
# loc 방식 (일일히 해줘야 함 -> 귀찮음.)(교수님 비추천 방법)

In [28]:
customerData.loc[ customerData.PRODUCTAGE <1,\
                  "PRODUCTAGE_NEW"] = 1

In [29]:
customerData.loc[ (customerData.PRODUCTAGE >= 1) &
                  (customerData.PRODUCTAGE < 2),\
                  "PRODUCTAGE_NEW"] = 2

In [30]:
customerData.loc[ (customerData.PRODUCTAGE >= 2), "PRODUCTAGE_NEW"] = 3

In [31]:
customerData.loc[ (customerData.PRODUCTAGE < 1) & \
                  (customerData.PRODUCTAGE_NEW != 1)]

Empty DataFrame
Columns: [CUSTID, AVGPRICE, EMI, DEVICECOUNT, PRODUCTAGE, CUSTTYPE, PRODUCTAGE_NEW]
Index: []

In [32]:
# map 함수방식

In [33]:
featuresData = \
    pd.read_csv("../dataset/feature_regression_example.csv")

In [34]:
featuresData.head(2)

,REGIONID,PRODUCTGROUP,PRODUCT,ITEM,YEARWEEK,YEAR,WEEK,QTY,HOLIDAY,HCLUS,PROMOTION,PRO_PERCENT
0,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201501,2015,1,1225,Y,1,Y,0.209442
1,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201502,2015,2,968,N,4,Y,0.209442

In [35]:
# 다만 함수로 할 가치는 없다.
def ynDecimalConvert(inValue):
    if inValue == "Y":
        outValue = 1
    else:
        outValue = 0
    return outValue

In [36]:
ynMap = {"Y":1, "N":0}

In [37]:
featuresData["HOLIDAY_NEW"] = featuresData.HOLIDAY.map(ynMap)

In [38]:
featuresData.head(3)

,REGIONID,PRODUCTGROUP,PRODUCT,ITEM,YEARWEEK,YEAR,WEEK,QTY,HOLIDAY,HCLUS,PROMOTION,PRO_PERCENT,HOLIDAY_NEW
0,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201501,2015,1,1225,Y,1,Y,0.209442,1
1,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201502,2015,2,968,N,4,Y,0.209442,0
2,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201503,2015,3,1209,N,4,Y,0.208155,0

In [39]:
customerData.CUSTID.str.lower()+\
    "_"+\
    customerData.EMI.astype(str)

0      a13566_3
1      a14219_2
2      a15312_2
3      a16605_2
4      b10634_2
         ...
145    z13253_2
146    z13534_3
147    z16428_2
148    z16735_2
149    z19835_2
Length: 150, dtype: object

In [40]:
sortKey = ["EMI", "AVGPRICE"]

In [41]:
customerData.sort_values(by=sortKey,
                         ascending=[True, True],
                         inplace=True, ignore_index=True)

In [49]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,N14862,2390.083736,1,6,1.000000,Early-bird,2
1,I17056,2963.370122,1,3,2.139196,Sleeping-dog,3
2,Y12458,2976.211190,1,3,2.199677,Sleeping-dog,3
3,O13586,2980.229239,1,3,2.038603,Sleeping-dog,3
4,Q16449,3048.308860,1,3,2.369758,Sleeping-dog,3

In [47]:
groupKey = ["EMI"]

In [55]:
customerData.groupby(groupKey)["AVGPRICE"].agg("mean")

EMI
1    3119.031810
2    3441.429664
3    3559.487188
Name: AVGPRICE, dtype: float64